# PipePlumbingFixtureFlowData Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PipePlumbingFixtureFlowData Members
PipePlumbingFixtureFlowData Class Methods Properties See Also
---
The PipePlumbingFixtureFlowData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the PipePlumbingFixtureFlowData |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DimensionFlow | The dimension flow which is used to calculate flow of the pipe. Units: (gal/min). |
| FixtureUnits | The fixture units of the pipe. |
| Flow | The actual flow of the plumbing fixture converted from dimension flow or fixture unit. Units: (gal/min). |
| FlowConfiguration | The flow configuration mode of the pipe. |
| FlowConversionMode | The flow conversion mode of the pipe. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
PipePlumbingFixtureFlowData Class
Autodesk.Revit.DB.Plumbing Namespace